; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v13 ?v8)
             (pred_2 ?v4 ?v3)
             (pred_12 ?v13 ?v3)
             (pred_5 ?v12 ?v13 )
	     (pred_6 ?v13)
             (pred_10 ?v5)
             (pred_11 ?v4)
             (pred_1 ?v3)
             (pred_4 ?v13)
             (pred_8 ?v4)
             (pred_3 ?v13)
             (pred_9 ))



(:action op_4
:parameters (?v2 ?v11 ?v1 ?v7)
:precondition (and (pred_10 ?v2) (pred_10 ?v11) (pred_11 ?v1) (pred_1 ?v7)
          (pred_7 ?v2 ?v11) (pred_2 ?v1 ?v7)
                   (pred_12 ?v11 ?v7) (pred_6 ?v2) 
                   (pred_4 ?v11) (pred_8 ?v1))
:effect (and  (pred_3 ?v11) (not (pred_4 ?v11))))


(:action op_2
:parameters (?v2 ?v10)
:precondition (and (pred_10 ?v2) (pred_10 ?v10)
               (pred_6 ?v2) (pred_7 ?v2 ?v10) (pred_3 ?v10))
:effect (and (pred_6 ?v10) (not (pred_6 ?v2))))

(:action op_5
:parameters (?v2 ?v1)
:precondition (and (pred_10 ?v2) (pred_11 ?v1) 
                  (pred_6 ?v2) (pred_5 ?v1 ?v2) (pred_9 ))
:effect (and (pred_8 ?v1)
   (not (pred_5 ?v1 ?v2)) (not (pred_9 ))))


(:action op_3
:parameters (?v2 ?v9 ?v6)
:precondition (and (pred_10 ?v2) (pred_11 ?v9) (pred_11 ?v6)
                  (pred_6 ?v2) (pred_8 ?v6) (pred_5 ?v9 ?v2))
:effect (and (pred_8 ?v9) (pred_5 ?v6 ?v2)
        (not (pred_8 ?v6)) (not (pred_5 ?v9 ?v2))))

(:action op_1
:parameters (?v2 ?v1)
:precondition (and (pred_10 ?v2) (pred_11 ?v1) 
                  (pred_6 ?v2) (pred_8 ?v1))
:effect (and (pred_9 ) (pred_5 ?v1 ?v2) (not (pred_8 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_14 obj_19 obj_18 obj_02 obj_08 obj_20 obj_03 obj_06 obj_16 obj_04 obj_10 obj_15 obj_13 obj_09 obj_12 obj_01
    obj_11 obj_07
    obj_05 obj_17
    )

    (:init
       (pred_9)

       (pred_10 obj_14)
       (pred_10 obj_19)
       (pred_10 obj_18)
       (pred_10 obj_02)
       (pred_10 obj_08)
       (pred_10 obj_20)
       (pred_10 obj_03)
       (pred_10 obj_06)
       (pred_10 obj_16)
       (pred_10 obj_04)
       (pred_10 obj_10)
       (pred_10 obj_15)
       (pred_10 obj_13)
       (pred_10 obj_09)
       (pred_10 obj_12)
       (pred_10 obj_01)
       (pred_1 obj_11)
       (pred_1 obj_07)
       (pred_11 obj_05)
       (pred_11 obj_17)

       (pred_7 obj_14 obj_08)
       (pred_7 obj_14 obj_19)
       (pred_7 obj_19 obj_20)
       (pred_7 obj_19 obj_18)
       (pred_7 obj_19 obj_14)
       (pred_7 obj_18 obj_03)
       (pred_7 obj_18 obj_02)
       (pred_7 obj_18 obj_19)
       (pred_7 obj_02 obj_06)
       (pred_7 obj_02 obj_18)
       (pred_7 obj_08 obj_16)
       (pred_7 obj_08 obj_20)
       (pred_7 obj_08 obj_14)
       (pred_7 obj_20 obj_04)
       (pred_7 obj_20 obj_03)
       (pred_7 obj_20 obj_19)
       (pred_7 obj_20 obj_08)
       (pred_7 obj_03 obj_10)
       (pred_7 obj_03 obj_06)
       (pred_7 obj_03 obj_18)
       (pred_7 obj_03 obj_20)
       (pred_7 obj_06 obj_15)
       (pred_7 obj_06 obj_02)
       (pred_7 obj_06 obj_03)
       (pred_7 obj_16 obj_13)
       (pred_7 obj_16 obj_04)
       (pred_7 obj_16 obj_08)
       (pred_7 obj_04 obj_09)
       (pred_7 obj_04 obj_10)
       (pred_7 obj_04 obj_20)
       (pred_7 obj_04 obj_16)
       (pred_7 obj_10 obj_12)
       (pred_7 obj_10 obj_15)
       (pred_7 obj_10 obj_03)
       (pred_7 obj_10 obj_04)
       (pred_7 obj_15 obj_01)
       (pred_7 obj_15 obj_06)
       (pred_7 obj_15 obj_10)
       (pred_7 obj_13 obj_09)
       (pred_7 obj_13 obj_16)
       (pred_7 obj_09 obj_12)
       (pred_7 obj_09 obj_04)
       (pred_7 obj_09 obj_13)
       (pred_7 obj_12 obj_01)
       (pred_7 obj_12 obj_10)
       (pred_7 obj_12 obj_09)
       (pred_7 obj_01 obj_15)
       (pred_7 obj_01 obj_12)
       (pred_4 obj_13)
       (pred_4 obj_16)
       (pred_12  obj_13 obj_11)
       (pred_12  obj_16 obj_07)
       (pred_3 obj_14)
       (pred_3 obj_19)
       (pred_3 obj_18)
       (pred_3 obj_02)
       (pred_3 obj_08)
       (pred_3 obj_20)
       (pred_3 obj_03)
       (pred_3 obj_06)
       (pred_3 obj_04)
       (pred_3 obj_10)
       (pred_3 obj_15)
       (pred_3 obj_09)
       (pred_3 obj_12)
       (pred_3 obj_01)

       (pred_2  obj_05 obj_11)
       (pred_2  obj_17 obj_07)
       (pred_5 obj_05 obj_01)
       (pred_5 obj_17 obj_01)
       (pred_6 obj_14)
    )

    (:goal (and
       (pred_5 obj_05 obj_10)
       (pred_5 obj_17 obj_18)
    ))
(:constraints
  (always (not (pred_6 obj_15)))
)
)

; plan
1. (op_2 obj_14 obj_19)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_19)
   goals met: 0 of 2
2. (op_2 obj_19 obj_18)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_18)
   goals met: 0 of 2
3. (op_2 obj_18 obj_03)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_03)
   goals met: 0 of 2
4. (op_2 obj_03 obj_10)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_10)
   goals met: 0 of 2
5. (op_2 obj_10 obj_12)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_12)
   goals met: 0 of 2
6. (op_2 obj_12 obj_01)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_01)
   goals met: 0 of 2
7. (op_5 obj_01 obj_05)
   deleted: (pred_5 obj_05 obj_01) (pred_9)
   added: (pred_8 obj_05)
   goals met: 0 of 2
8. (op_2 obj_01 obj_12)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_12)
   goals met: 0 of 2
9. (op_2 obj_12 obj_10)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_10)
   goals met: 0 of 2
10. (op_1 obj_10 obj_05)
   deleted: (pred_8 obj_05)
   added: (pred_9) (pred_5 obj_05 obj_10)
   goals met: 1 of 2
11. (op_2 obj_10 obj_12)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_12)
   goals met: 1 of 2
12. (op_2 obj_12 obj_01)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_01)
   goals met: 1 of 2
13. (op_5 obj_01 obj_17)
   deleted: (pred_5 obj_17 obj_01) (pred_9)
   added: (pred_8 obj_17)
   goals met: 1 of 2
14. (op_2 obj_01 obj_12)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_12)
   goals met: 1 of 2
15. (op_2 obj_12 obj_10)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_10)
   goals met: 1 of 2
16. (op_2 obj_10 obj_03)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_03)
   goals met: 1 of 2
17. (op_2 obj_03 obj_18)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_18)
   goals met: 1 of 2
18. (op_1 obj_18 obj_17)
   deleted: (pred_8 obj_17)
   added: (pred_9) (pred_5 obj_17 obj_18)
   goals met: 2 of 2
